const answer = [
    {
        answers: {
            b1: {
                text: "ฉันรู้สึกกดดัน เเละอยากให้พวกคุณเข้าใจฉันมากกว่านี้",
            },
            b2: {
                text: "ฉันรู้สึกว่าเราไม่เข้าใจกัน เเละฉันอยากให้เราลองคุยอย่างจริงใจ",
            },
            b3: {
                text: "ฉันเหนื่อยเเละเครียดมากเเต่ฉันไม่รู้จะพูดยังไง",
            },
            b4: {
                text: "ฉันอยากมีพื่นที่ของตัวเองบ้าง โดยที่ไม่รู้สึกผิด",
            },
        },
    },
    {
        answers: {
            b1: {
                text: "สบายใจขึ้น",
            },
            b2: {
                text: "กังวลหรือกลัวคนอื่นจะไม่เข้าใจ",
            },
            b3: {
                text: "ผิดหวัง",
            },
        },
    },
    {
        answers: {
            b1: {
                text: "ทุกคนคงมีเรื่องทุกข์",
            },
            b2: {
                text: "ไม่หรอก",
            },
        },
    },
    {
        answers: {
            b1: {
                text: "ได้สิ",
            },
            b2: {
                text: "ก็คงได้",
            },
        },
    },
    {
        answers: {
            b1: {
                text: "ได้สิ พวกเขามีปัญหาอะไร",
            },
            b2: {
                text: "ฉันพร้อมรับฟังปัญหาของพวกเขา",
            },
            b3: {
                text: "ถ้าฉันช่วยด้วยฉันจะช่วย",
            },
        },
    },
    {
        answers: {
            b1: {
                text: "พูดคุยกับพวกเขา เพราะฉันรู้ว่าพวกเขาต้องการใครสักคนที่รับฟังพวกเขา",
            },
            b2: {
                text: "ถามถึงปัญหาเเละหาวิธีเเก้ไข",
            },
            b3: {
                text: "พาไปกินของกินอร่อย พาไปทำกิจกรรมที่สนุก",
            },
            b4: {
                text: "พูดปลอบโยนพวกเขาเเละให้กำลังใจ",
            },
        },
    },
    {
        answers: {
            b1: {
                text: "กอดพวกเขา หรืออยู่ข้างๆ โดยไม่พูดอะไร ให้เขารุ้ว่าไม่ได้เผชิญหน้าอยู่คนเดียว",
            },
            b2: {
                text: "บอกให้เขาหยุดร้อง เเล้วพยายามหาทางเเก้ไขปัญหาให้",
            },
            b3: {
                text: "รู้สึกอึกอัด เพราะไม่อยากยุ่งกับปัญหาของคนอื่น",
            },
            b4: {
                text: "ถามสาเหตุเเละเรื่องราวที่พวกเขาได้พบเจอมา",
            },
        },
    },
    {
        answers: {
            b1: {
                text: "ไม่ เลยพวกเขาให้ความสำคัญกับสิ่งที่ฉันพูด",
            },
            b2: {
                text: "บางครั้ง รู้สึกว่าพวกเขาเเค่ฟัง เเต่ไม่เข้าใจจริงๆ",
            },
            b3: {
                text: "บ่อยครั้ง พวกเขามักจะตัดสินใจหรือพูดเเทรกก่อนที่ฉันจะพูดจบ",
            },
            b4: {
                text: "ตลอดเวลา ฉันรู้สึกว่าไม่มีพื้นที่ให้พูดเลย",
            },
        },
    },
    {
        answers: {
            b1: {
                text: "ให้ทุกคนรับฟังกันมากขึ้น โดยไม่มีการตัดสินกัน",
            },
            b2: {
                text: "ให้เเต่ละคนเเสดงความรู้สึกได้ โดยไม่กลัวว่าจะถูกมองว่าอ่อนเเอ",
            },
            b3: {
                text: "ให้มีเวลาพูดคุยกันจริงๆ โดยไม่มีสิ่งรบกวน",
            },
            b4: {
                text: "ให้ทุกคนเห้นคุณค่าของความรู้สึกของกันเเละกัน",
            },
        },
    },
    {
        answers: {
            b1: {
                text: "ฟังฉันด้วยใจ เปืดรับ เเละไม่รีบตัดสินใจ",
            },
            b2: {
                text: "ให้คำเเนะนำเท่าที่จำเป็น โดยไม่พยายามควบคุมฉัน",
            },
            b3: {
                text: "พยายามเข้าใจฉันมากกว่าการเปรียบเทียบฉันกับคนอื่น",
            },
            b4: {
                text: "มีเวลาให้ฉันบ้าง เเทนที่จะยุ่งอยู่กับเรื่องของตัวเองตลอด",
            },
        },
    },
    {
        answers: {
            b1: {
                text: "ให้เงินลูกใช้อย่างอิสระแล้วให้เขาเรียนรู้เองจากผลที่เกิดขึ้น",
            },
            b2: {
                text: "กำหนดงบประมาณรายสัปดาห์และให้ลูกบริหารเอง",
            },
            b3: {
                text: "ควบคุมการใช้จ่ายของลูกอย่างเข้มงวด",
            },
            b4: {
                text: "สอนเรื่องการออมเงินและให้รางวัลเมื่อลูกบริหารเงินได้ดี",
            },
        },
    },
    {
        answers: {
            b1: {
                text: "บอกลูกว่าให้เลิกยุ่งกับเพื่อนคนนั้นไปเลย",
            },
            b2: {
                text: "รับฟังโลกและช่วยให้เขาคิดหาทางแก้ไขปัญหา",
            },
            b3: {
                text: "สอนลูกให้รู้จักให้อภัยและเข้าใจมุมมองของเพื่อน",
            },
            b4: {
                text: "บอกลูกว่าชีวิตก็เป็นอย่างนี้ต้องรับมือเองให้ได้",
            },
        },
    },
    {
        answers: {
            b1: {
                text: "ใช้วิธีเคร่งครัดและกำหนดใช้วิธีเคร่งครัดและกำหนดกฎเกณฑ์ให้ชัดเจน",
            },
            b2: {
                text: "พยายามทำความเข้าใจและเปิดโอกาสให้ลูกแสดงความคิดเห็น",
            },
            b3: {
                text: "ปล่อยให้เป็นเรื่องของแม่และพ่อเพราะเเม่และพ่อต้องดูแลเรื่องพวกนี้ได้ดีกว่า",
            },
            b4: {
                text: "ลงโทษลูกเพื่อให้เขารู้ว่าอะไรถูกอะไรผิด",
            },
        },
    },
    {
        answers: {
            b1: {
                text: "อธิบายเหตุผลที่ต้องการไปเที่ยวกับเพื่อน",
            },
            b2: {
                text: "เชื่อฟังพ่อแม่และยกเลิกแผนไปเที่ยว",
            },
            b3: {
                text: "ถามเหตุผลของพ่อและแม่ที่ไม่ต้องการให้ไป",
            },
            b4: {
                text: "แอบไปโดยไม่บอกพ่อแม่",
            },
        },
    },
    {
        answers: {
            b1: {
                text: "มีเเน่นอน ฉันรู้สึกปลอดภัยเเละกล้าที่จะเป็นตัวเอง",
            },
            b2: {
                text: "มีบางในบางครั้ง เเต่ยังไม่สมบูรณ์เเบบ",
            },
            b3: {
                text: "ค่อนข้างน้อย เพราะทุกคนมักยุ่งกับเรื่องของตัวเอง",
            },
            b4: {
                text: "ไม่มีเลย ฉันรู้สึกว่าไม่มีพื้นที่ปลอดภัยให้ฉันเเสดงความรู้สึก",
            },
        },
    },
    {
        answers: {
            u1: {
                text: "เราอาจจะไม่พูดกันบ่อย อาจมีทะเลาะกันบ้าง เเต่สุดท้ายเราเป็นครอบครัวกันเสมอ ไม่ว่าพรุ่งนี้จะเป็นอย่างไร ขอให้รู้ว่าเธอไม่ได้อยู่คนเดียว ฉันอยู่ตรงนี้เสมอ",
            },
            u2: {
                text: "ไม่ว่าชีวิตจะเหนื่อยเเค่ไหน กลับมาบ้านเถอะ ที่นี่มีคนที่รักเธออย่างไม่มีเงื่อนไข ไม่มีใครสมบูรณ์เเบบ เเค่เป็นตัวเอง เเละเชื่อว่าเธอมีค่ามากพอเสมอ",
            },
            u3: {
                text: "ไม่ต้องเป็นพ่อแม่ที่สมบูรณ์แบบแต่เป็นพ่อแม่ที่พร้อมจะรับฟังและอยู่ข้างลูกเสมอก็เพียงพอแล้วลูกไม่ได้ต้องการคำตอบที่ถูกต้องเสมอไปแต่ต้องการคนที่พร้อมจะกอดเขาในวันที่ทุกอย่างผิดพลาด",
            },
            u4: {
                text: "การที่อบอุ่นไม่ได้ขึ้นอยู่กับขนาดของหลังคาแต่อยู่ที่หัวใจที่พร้อมจะอบกอดกันและกันอย่าปล่อยให้ความเงียบสร้างกำแพงแต่จงใช้ความรักทำให้มันพังลงไปแทน",
            },
        },
    },
    {
        answers: {
            f1: {
                text: "เราอาจจะไม่พูดกันบ่อย อาจมีทะเลาะกันบ้าง เเต่สุดท้ายเราเป็นครอบครัวกันเสมอ ไม่ว่าพรุ่งนี้จะเป็นอย่างไร ขอให้รู้ว่าเธอไม่ได้อยู่คนเดียว ฉันอยู่ตรงนี้เสมอ",
            },
            f2: {
                text: "ไม่ว่าชีวิตจะเหนื่อยเเค่ไหน กลับมาบ้านเถอะ ที่นี่มีคนที่รักเธออย่างไม่มีเงื่อนไข ไม่มีใครสมบูรณ์เเบบ เเค่เป็นตัวเอง เเละเชื่อว่าเธอมีค่ามากพอเสมอ",
            },
            f3: {
                text: "ไม่ต้องเป็นพ่อแม่ที่สมบูรณ์แบบแต่เป็นพ่อแม่ที่พร้อมจะรับฟังและอยู่ข้างลูกเสมอก็เพียงพอแล้วลูกไม่ได้ต้องการคำตอบที่ถูกต้องเสมอไปแต่ต้องการคนที่พร้อมจะกอดเขาในวันที่ทุกอย่างผิดพลาด",
            },
            f4: {
                text: "การที่อบอุ่นไม่ได้ขึ้นอยู่กับขนาดของหลังคาแต่อยู่ที่หัวใจที่พร้อมจะอบกอดกันและกันอย่าปล่อยให้ความเงียบสร้างกำแพงแต่จงใช้ความรักทำให้มันพังลงไปแทน",
            },
        },
    },
    {
        answers: {
            m1: {
                text: "เราอาจจะไม่พูดกันบ่อย อาจมีทะเลาะกันบ้าง เเต่สุดท้ายเราเป็นครอบครัวกันเสมอ ไม่ว่าพรุ่งนี้จะเป็นอย่างไร ขอให้รู้ว่าเธอไม่ได้อยู่คนเดียว ฉันอยู่ตรงนี้เสมอ",
            },
            m2: {
                text: "ไม่ว่าชีวิตจะเหนื่อยเเค่ไหน กลับมาบ้านเถอะ ที่นี่มีคนที่รักเธออย่างไม่มีเงื่อนไข ไม่มีใครสมบูรณ์เเบบ เเค่เป็นตัวเอง เเละเชื่อว่าเธอมีค่ามากพอเสมอ",
            },
            m3: {
                text: "ไม่ต้องเป็นพ่อแม่ที่สมบูรณ์แบบแต่เป็นพ่อแม่ที่พร้อมจะรับฟังและอยู่ข้างลูกเสมอก็เพียงพอแล้วลูกไม่ได้ต้องการคำตอบที่ถูกต้องเสมอไปแต่ต้องการคนที่พร้อมจะกอดเขาในวันที่ทุกอย่างผิดพลาด",
            },
            m4: {
                text: "การที่อบอุ่นไม่ได้ขึ้นอยู่กับขนาดของหลังคาแต่อยู่ที่หัวใจที่พร้อมจะอบกอดกันและกันอย่าปล่อยให้ความเงียบสร้างกำแพงแต่จงใช้ความรักทำให้มันพังลงไปแทน",
            },
        },
    },
];

let currentAnswer = 0;

function displayanswer() {
    const quizElement = document.getElementById('answer');
    const answerx = answer[currentAnswer];
    if (answerx) {
        let html = ``;
        for (const option in answerx.answers) {
            html += `<button type="button" class="btn custom-btn btbg rounded-pill" value="${option}" id="${option}">${answerx.answers[option].text}</button>`;
        }
        quizElement.innerHTML = html;
        attachButtonClickHandlers();
    } else {
    
    }
}

function attachButtonClickHandlers() {
    const choiceButtons = document.querySelectorAll('.custom-btn');
    choiceButtons.forEach((button) => {
        button.addEventListener('click', handleAnswer);
    });
}
function handleAnswer(event) {
    const selectedButton = event.target;
    const selectedText = selectedButton.textContent;

    if (selectedButton.id.startsWith('m')) {
        document.querySelector('.momtext').textContent = selectedText;
    } else if (selectedButton.id.startsWith('u')) {
        document.querySelector('.myselftext').textContent = selectedText;
    } else if (selectedButton.id.startsWith('f')) {
        document.querySelector('.dadtext').textContent = selectedText;
    }

    if (currentAnswer < answer.length-1) {
        currentAnswer++;
        isWaitingForAnswer = false;
        displayanswer();
        playNextVideo();
    } else {
        isWaitingForAnswer = false;  
        playNextVideo();       
    }
}
displayanswer();